class Encapsulation {
    //Инкапсуляция это принцип объединяющий данные и код, манипулирующий этими данными,а так же
//защищающий данные от прямого доступа и неправильного использования
    private int a, b;         //создали 2 приватные переменные (можно присвоить им значения)

    public int showResault() {    //создали меод который будет показывать результат суммы a+b
        return a + b;
    }
//чтобы можно было изменить значения переменных а и б непосредственно в классе мэйн, можно истользовать методы set(задать) и get(принять)
//для этого в классе Encapsulation нажимаем alt+ins, выбираем на веладке getter and setter, далее выбираем необходимые переменные

//при этом автоматически создаются методы, позволяющие менять значения переменных в классе мэйн, обратившись к этим методам

    public int getA() {
        return a;
    }

    public void setA(int a) {
        this.a = a;
    }

    public int getB() {
        return b;
    }

    public void setB(int b) {
        this.b = b;
    }
}
