//lesson7 class
class ForLoop {    //цикл for эдентичен циклу while/do, но как-правило цикл for используется, когда известно точное число повторений

    public void make() {
        for (int i = 0; i < 8; i = i + 2) {     //i=0-объявление и инициализация переменной (счетчик), i<0-условие, далее выполняется тело метода, и только потом к i прибавляется число 2
            System.out.println(i);   // только потом в следующем цикле переменная увеличивается на 2
            //в консоль выдаст 0 2 4 6
        }
    }


    int[] array = new int[]{1, 2, 3, 6, -10};  //создали массив, присвоили его переменнным значения


    public void foo() {
        for (int i = 0; i < array.length; i++) {  //массив начинается с нулевого элемента, поэтому i=0, условие пока i<длинны массива, выводим тело. в следующем цикле  i=i+1
            System.out.println(array[i]);
        }
        //ниже пример упрощенной записи этого цикла
        //создали метод, в котором переменная элемент будет поочередно принимать все значения, находящиеся в данном массиве
        for (int element : array) {
            System.out.println(element); //выводим все элементы. в консоль выдаст 1 2 3 6 -10 (в столбик)
        }
    }

}
