enum Music {
    //класс енам позволяет хранить набор констант, как правило это константы объединенные каким-то смыслом(жанры музыки, дни недели,профессии,и т.д.)
    CLASSIC, ROCK, POP; //запишем несколько констант(пишутся с большой буквы),ВСЕ ОНИ ЯВЛЯЮТСЯ ОТДЕЛЬНЫМИ ОБЪЕКТАМИ.
    //для того чтобы создать объект, необходимо в классе мэйн написать Music имя=Music.CLASSIC; т.е. без слова new.

    //данный класс обладает некоторыми особенностями. создадим переменые
    private int i;
    private String name;

    // если создать конструктор alt+ins, то тогда необходимо инициализировать их у объекта, т.е. вместо CLASSIC,ROCK,POP; прописывать:
/*
 CLASSIC(5,"classic"),ROCK(3,"rock"),POP(7,"pop");

 Music(int i, String name) {
     this.i = i;
     this.name = name;
     */
//чтобы работать непосредственно с полями объекта в классе мэйн, необходимо использовать геттеры и сеттеры
    public int getI() {
        return i;
    }

    public String getName() {
        return name;
    }

    //класс enum может так же иметь и обычные методы, например создадим метод foo
    public void foo() {
        System.out.println("It's true!");
        //так же мы можем работать непосредственно с перечисленными объектами. Например
        System.out.println(Music.CLASSIC.getI());  //показать какой порядковый номет объекта. У нас CLASSIC под номером 0

    }
}
