class MyArrays {                //массив можно создать двумя способами: с помощью слова new, с помощью прямой инициализации
    int[] array = new int[3];     // тип данных[] имя массива=new тип данных [кол-во объектов в массиве]
    Candy[] box = new Candy[5];    //массив коробка с (объектами) конфетами в кол-ве 5 штук
    int[] array2 = new int[]{10, 3, 7};  //прямая инициализация. массив array2 с тремя числами{10,3,7} (индексы чисел 0 1 2)

    //чтобы создать массив box2 с конфетами с помощью прямой инициализации, необходимо сначала создать объекты(конфеты)
    Candy candyFirst = new Candy();
    Candy candySecond = new Candy();
    Candy candyThird = new Candy();
    Candy[] box2 = {candyFirst, candySecond, candyThird}; //создание  с помощью прямой инициализации
    Candy[] box3;   //просто создали массив box3 без инициализации


    public void foo() {
        Candy candy = new Candy();   //создали конфету
        box[0] = candy;               //положили конфету в коробку, под индексом 0
        System.out.println(box[0]);    //вывели конфету под индексом 0 в консоль
        System.out.println(box2[2]);   //вывели в консоль элемент под индексом 2(т.е. третий с нуля 0 1 2) из коробки box2
        //в консоль выдаст ссылку на объекты: Candy@5d624da6
        //Candy@1e67b872


        for (int i = 0; i < array2.length; ++i) { //цикл for используем для вывода в консоль всех элементов массива array2
            System.out.println(array2[i]);
        }

    }

    //многомерных массивов в Java не существует.Но существуют массивы массивов
    public void show() {
        int[][] arrayAr = new int[2][2];   //создание массива с размерностью 2 на 2
        int[][] arrayAr1 = {{1, 2}, {3, 4}};  //данный массив представляет собой следующий вид    1 2   индексы 00 01
        //                                                                                        3 4           10 11
        System.out.println(arrayAr1[0][1]); //выводим первый элемент нулевого массива. Выдаст: 2
    }

}
