class Ostrich extends Bird { //класс страус приобрел все поля и методы класса птица(ключевое слово extends)

    //так же добавим к данному классу страус собственные методы (прятать голову)
    public void hideHead() {
        System.out.println("I ostrich and I scared!");
    }

    // при создании конструктора в классе птица(возможность сразу назначать значение полей), в классе-наследнике
    //тоже необходимо создаватьть конструктор
    // при создании конструктора будет ключевое слово super Пример
 /*   public Ostrich (String name, Wings wings){
    super (name,wings)
}*/
}
