//lesson11 class
class StaticVariablesAndMethods {
    //модификатор доступа статик. он применим к классам,полям,методам,логическим блокам

    //статик поля. создадим переменную типа инт
    public static int variable;  //поля,как и методы с модификатором статик относятся к классу, а не к объекту
    //т.е.если мы создадим какие либо объекты нашего класса в классе мэйн, то у них у всех будет общее поле variable
    //и чтобы обратиться к данному полю, то нужно обращаться не к объекту а к классу (StaticVariablesAndMethods.variable)

    //статик методы. создадим переменную, затем создадим метод статик. и попробуем данную переменную в этом методе вывести
    public int variable1;

    public static void foo() {
        //  System.out.println(variable1.foo);  компилятор не дает этого сделать, так как
        //  в статическом методе мы не можем использовать поля(variable1), относящиеся к объекту
        // но мы можем бращаться к статическим полям(variable), так как они являются переменными класса, а не объекта
    }
    //еще в статических методах нельзя работать с обычными методами.

    public void show() {
        System.out.println("Something");
    }
  /*  public static void foo1() {
        show();                //не дает обратиться к методу шоу
    }*/

    // Но в нестатическом методе, мы можем использовать(обращаться) к статическому методу
    public void went() {
        foo();
    }

    //статические блоки. пишутся {}, и используются для инициализации полей. в них так же могут находиться и методы
    static {
        variable = foo1();
    }

    public static int foo1() {
        return 1;
    }
}
